/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "ค่าไม่ถูกต้อง";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "ค่า %@ ไม่ถูกต้อง";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "โปรดให้ค่าที่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "ค่าไม่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "ค่า %@ ไม่ถูกต้อง";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "ค่าเล็กเกินไป";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "ค่าใหญ่เกินไป";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "โปรดให้ค่าที่ถูกต้อง";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "โปรดให้ตัวเลขไม่ต่ำกว่า %@";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "โปรดให้ตัวเลขระหว่าง %1$@ กับ %2$@";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "โปรดให้ตัวเลขไม่เกิน %@";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "ค่า %@ เล็กเกินไป";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "ค่า %@ ใหญ่เกินไป";

/* NSFileLockingError */
"Err255-C" = "ไม่สามารถล็อกไฟล์ได้";

/* NSFileLockingError */
"Err255-R" = "ไฟล์อาจถูกล็อกเรียบร้อยแล้ว หรือไม่ก็คุณไม่มีสิทธิในการล็อกไฟล์";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "ไม่สามารถล็อกไฟล์ “%@”";

/* NSFileReadUnknownError */
"Err256" = "ไม่สามารถเปิดไฟล์ได้";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "ไม่สามารถเปิดไฟล์ “%@”";

/* NSFileReadNoPermissionError */
"Err257" = "ไม่สามารถเปิดไฟล์ได้เนื่องจากคุณไม่มีสิทธิในการดู";

/* NSFileReadNoPermissionError */
"Err257-C" = "คุณไม่มีสิทธิ";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "ในการดูหรือเปลี่ยนสิทธิ เลือกรายการใน Finder แล้วเลือก File > Get Info";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "ไม่สามารถเปิด “%@” เนื่องจากคุณไม่มีสิทธิในการดู";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "ชื่อไฟล์ไม่ถูกต้อง";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "รายการที่เลือกไม่สามารถเปิดได้เนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259" = "ไม่สามารถเปิดไฟล์เนื่องจากรูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259-C" = "รูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadCorruptFileError */
"Err259-R" = "ไฟล์อาจเสียหาย ตัดขาด หรืออยู่ในรูปแบบที่ไม่ได้คาดไว้";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "ไม่สามารถเปิดไฟล์ “%@” เนื่องจากรูปแบบไฟล์ไม่ถูกต้อง";

/* NSFileReadNoSuchFileError */
"Err260" = "ไม่สามารถเปิดไฟล์ได้เนื่องจากไม่มีไฟล์";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "ไม่มีโฟลเดอร์ “%@” ที่กำหนด";

/* NSFileReadNoSuchFileError */
"Err260-C" = "ไม่มีไฟล์";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "ไม่มีโฟลเดอร์";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "ไม่สามารถเปิดไฟล์ “%@” เนื่องจากไม่มีไฟล์นั้น";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "ไม่สามารถเปิดไฟล์โดยใช้รหัสอักขระที่กำหนด";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "รหัสอักขระที่กำหนดใช้งานไม่ได้";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "ไม่สามารถใช้รหัสอักขระ %@";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "ไฟล์อาจมีการเก็บบันทึกโดยใช้รหัสอักขระที่แตกต่างกัน หรืออาจจะไม่ใช่ไฟล์ข้อความ";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "ไม่สามารถเปิดไฟล์โดยใช้รหัสอักขระ %@";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "ไม่สามารถเปิดไฟล์ “%2$@” โดยใช้รหัสอักขระ %1$@";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "ไม่สามารถเปิดไฟล์่ได้เนื่องจากประเภทของ URL ไม่รองรับ";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "ไม่รองรับประเภทของ URL ที่กำหนด";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "ไม่สามารถเปิดไฟล์ “%1$@” เนื่องจากประเภท %2$@ ของ URL ไม่รองรับ";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "ไม่สามารถเปิดไฟล์ได้เนื่องจากประเภทของ URL %@ ไม่รองรับ";

/* NSFileReadTooLargeError */
"Err263" = "ไม่สามารถเปิดไฟล์ได้เนื่องจากขนาดใหญ่เกินไป";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "ไฟล์ใหญ่เกินไป";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "ไม่สามารถเปิดไฟล์ “%@” เนื่องจากขนาดใหญ่เกินไป";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "ไม่สามารถเปิดไฟล์ได้เนื่องจากไม่สามารถวิเคราะห์รหัสอักขระของเนื้อความ";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "ไม่สามารถวิเคราะห์รหัสอักขระของเนื้อหา";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "คุณอาจเปิดไฟล์ได้โดยระบุรหัสอักขระที่แน่นอน";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "ไม่สามารถเปิดไฟล์ “%@” เนื่องจากไม่สามารถวิเคราะห์รหัสอักขระของเนื้อความ";

/* NSUserCancelledError */
"Err3072-C" = "การทำงานยกเลิก";

/* NSPropertyListCorruptError */
"Err3840" = "ไม่สามารถอ่านข้อมูลได้เนื่องจากข้อมูลเสียหาย";

/* NSPropertyListCorruptError */
"Err3840-C" = "ข้อมูลเสียหาย";

/* NSPropertyListUnknownVersionError */
"Err3841" = "ไม่สามารถอ่านข้อมูลได้เนื่องจากข้อมูลอยู่ในรูปแบบที่แอพพลิเคชันไม่เข้าใจ";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "ข้อมูลอยู่ในรูปแบบที่แอพพลิเคชันไม่เข้าใจ";

/* NSPropertyListReadStreamError */
"Err3842" = "ไม่สามารถอ่านข้อมูลได้เนื่องจากข้อผิดพลาดในแหล่งของข้อมูล";

/* NSPropertyListReadStreamError */
"Err3842-C" = "ข้อผิดพลาดเกิดขึ้นในแหล่งของข้อมูล";

/* NSPropertyListWriteStreamError */
"Err3851" = "ไม่สามารถเขียนข้อมูลลงได้เนื่องจากข้อผิดพลาดปลายทางสำหรับข้อมูล";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "ข้อผิดพลาดเกิดขึ้นที่ปลายทางกับข้อมูล";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "ไม่มีโฟลเดอร์ “%@” ที่กำหนด";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "ไม่สามารถลบ “%@”";

/* NSFileNoSuchFileError */
"Err4-C" = "ไม่มีไฟล์";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "ไม่มีโฟลเดอร์";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "ไม่มีไฟล์ “%@” ที่กำหนด";

/* NSFileWriteUnknownError */
"Err512" = "ไม่สามารถบันทึกไฟล์่ได้";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "ไม่สามารถบันทึก “%1$@” เนื่องจากไม่สามารถอัพเดตไฟล์แบ็กอัพ";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "ไม่สามารถคัดลอก “%1$@” ไปที่ “%2$@”";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "ไม่สามารถโยง “%1$@” ไปที่ “%2$@”";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "ไม่สามารถย้าย “%1$@” ไปที่ “%2$@”";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "ไม่สามารถลบ “%@”";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "ไม่สามารถบันทึกไฟล์่แบ็กอัพ";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "ไฟล์แบ็กอัพอาจถูกล็อกอยู่ หรือไม่ก็คุณอาจไม่มีสิทธิในการบันทึก ในการดูหรือเปลี่ยนสิทธิ เลือกรายการใน Finder และเลือก File > Get Info";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "ไม่สามารถบันทึกไฟล์ “%2$@” ลงในโฟลเดอร์ “%1$@”";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "ไม่สามารถบันทึกไฟล์ “%@”";

/* NSFileWriteNoPermissionError */
"Err513" = "ไม่สามารถบันทึกไฟล์ได้เนื่องจากคุณไม่มีสิทธิในการดู";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "ไม่สามารถคัดลอก “%1$@” เนื่องจากคุณไม่มีสิทธิในการเข้าใช้ “%2$@”";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "ไม่สามารถโยง “%1$@” เนื่องจากคุณไม่มีสิทธิในการเข้าใช้ “%2$@”";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "ไม่สามารถย้าย “%1$@” เนื่องจากคุณไม่มีสิทธิในการเข้าใช้ “%2$@”";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "ไม่สามารถลบ “%@” เนื่องจากคุณไม่มีสิทธิในการเข้าใช้";

/* NSFileWriteNoPermissionError */
"Err513-C" = "คุณไม่มีสิทธิ";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "ในการดูหรือเปลี่ยนสิทธิ เลือกรายการใน Finder แล้วเลือก File > Get Info";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "คุณไม่มีสิทธิในการบันทึกไฟล์ “%2$@” ในโฟลเดอร์ “%1$@”";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "คุณไม่มีสิทธิในการบันทึกไฟล์ “%@”";

/* NSFileWriteInvalidFileNameError */
"Err514" = "ไม่สามารถบันทึกรายการที่เลือกเนื่องจากชื่อไฟล์ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "ไม่สามารถลบรายการที่เลือกเนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "ชื่อไฟล์ไม่ถูกต้อง";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "ไม่สามารถบันทึกรายการที่เลือกเนื่องจากชื่อไฟล์ “%@” ไม่ถูกต้อง";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "ไม่สามารถบันทึกไฟล์ได้โดยใช้รหัสอักขระที่กำหนด";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "รหัสอักขระที่กำหนดใช้งานไม่ได้";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "ไม่สามารถใช้รหัสอักขระ %@";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "หากเป็นไปได้โปรดเลือกรหัสอักขระอันอื่น";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "ไม่สามารถบันทึกไฟล์ได้โดยใช้รหัสอักขระ %@";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "ไม่สามารถบันทึกไฟล์ “%2$@” ได้โดยใช้รหัสอักขระ %1$@";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "ไม่สามารถบันทึกไฟล์่ได้เนื่องจากประเภทของ URL ไม่รองรับ";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "ไม่รองรับประเภทของ URL ที่กำหนด";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "ไม่สามารถบันทึกไฟล์ “%1$@” เนื่องจากประเภท %2$@ ของ URL ไม่รองรับ";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "ไม่สามารถบันทึกไฟล์ได้เนื่องจากประเภทของ URL %@ ไม่รองรับ";

/* NSFileWriteOutOfSpaceError */
"Err640" = "ไม่สามารถบันทึกไฟล์ได้เนื่องจากเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "ไม่สามารถคัดลอก “%1$@” ไปที่ “%2$@” เนื่องจากมีเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "ไม่สามารถโยง “%1$@” ไปที่ “%2$@” เนื่องจากมีเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "ไม่สามารถย้าย “%1$@” ไปที่ “%2$@” เนื่องจากมีเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "ไม่มีเนื้อที่เพียงพอ";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "ดิสก์โวลุ่ม “%@” มีเนื้อที่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "ลบไฟล์บางส่วนออกจากดิสก์โวลุ่ม แล้วลองอีกครั้งหนึ่ง";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "คุณไม่สามารถบันทึกไฟล์ “%@” เนื่องจากมีเนื้อที่ี่ไม่เพียงพอ";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "คุณไม่สามารถบันทึกไฟล์ “%1$@” เนื่องจากดิสก์โวลุ่ม “%2$@” ไม่มีเนื้อที่เพียงพอ";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "ไม่สามารถบันทึกไฟล์ได้เนื่องจากดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "ดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "ดิสก์โวลุ่ม “%@” อ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "ลองบันทึกไฟล์ในดิสก์โวลุ่มอื่น";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "ไม่สามารถบันทึกไฟล์ “%@” เนื่องจากดิสก์โวลุ่มอ่านได้อย่างเดียว";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "ไม่สามารถบันทึกไฟล์ “%1$@” เนื่องจากดิสก์โวลุ่ม “%2$@” อ่านได้อย่างเดียว";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "การทำงานไม่เสร็จ (ข้อผิดพลาด %1$@ %2$ld)";

